### Pandas 라이브러리 설명

PPT의 기본 설명 참고

In [1]:
# Pandas import
import pandas as pd

**Series 데이터 생성하기**

In [2]:
# Series 데이터 생성하기
# 순서를 표시하는 인덱스가 자동으로 부여된다.
# 세로축 라벨을 index, 입력한 데이터를 values라고 한다.
s = pd.Series([4, 7, -5, 3])
s

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
# Series의 값만 확인하기
s.values

array([ 4,  7, -5,  3], dtype=int64)

In [ ]:
# Series의 인덱스만 확인하기
s.index

In [ ]:
# Series의 자료형 확인하기
s.dtypes

In [4]:
# 시리즈 내의 원소 데이터 타입은 달라도 된다.
s2 = pd.Series(['a', 'b', 'c', 1, 2, 3, 1.34])
s2

0       a
1       b
2       c
3       1
4       2
5       3
6    1.34
dtype: object

In [5]:
# 특정 인덱스에 데이터가 없음을 표시할 수도 있다.
import numpy as np # 다음차시에 배울 라이브러리
s3 = pd.Series([np.nan, 10, 30]) # nan : 없다는 의미. 비어있다는 의미.
s3

0     NaN
1    10.0
2    30.0
dtype: float64

In [6]:
# 인덱스를 바꿀 수 있다. # 날짜같은 값도 인덱스로 삽입 가능.
s4 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
s4

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
# Series 데이터 생성에 딕셔너리를 사용할 수 있다!
# 딕셔너리의 key가 index가 되면서 index와 value 값을 한꺼번에 입력 가능하다. 
# 딕셔너리 복습 : {} 이런 중괄호 내에 key : value 형식의 아이템들을 삽입하는 형태.
'''
s = pd.Series(dict_data) 와 같은 구조를 통해 생성 가능하다.
'''
s5 = pd.Series({'국어':100, '영어':95, '수학':90})
s5

국어    100
영어     95
수학     90
dtype: int64

딕셔너리를 이용하여 다음과 같이 series 데이터 obj를 만들어보자.

In [ ]:
'''
California          NaN  
Ohio            35000.0  
Texas           71000.0  
Oregon          16000.0  
Utah             5000.0
dytpe: float64
'''

In [ ]:
# 여기에 코드를 입력하여 문제를 풀어주세요.

**DataFrame 데이터 생성하기**

In [ ]:
# DataFrame 데이터 생성하기
# 생성하기 전, DataFrame에 들어갈 데이터를 정의해줘야 하는데,
# 이는 python의 dictionary 또는 numpy의 array로 정의할 수 있다.

# 형식) df = pd.DataFrame(data, index=index_data, columns=columns_data)

In [8]:
pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [9]:
# numpy 배열 데이터를 입력해 생성
data_list = np.array([[10, 20, 30], [40, 50, 60], [70, 80, 90]])
pd.DataFrame(data_list)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [10]:
# 그 안에서도 바꿀 수 있는 index와 columns
data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]])
index_date = pd.date_range('2022-07-25', periods=4) # 날짜 자동 생성
column_list = ['A', 'B', 'C']
pd.DataFrame(data, index = index_date, columns=column_list)

             A   B   C
2022-07-25   1   2   3
2022-07-26   4   5   6
2022-07-27   7   8   9
2022-07-28  10  11  12

In [11]:
# 딕셔너리 데이터를 이용해 생성
table_data = {'연도': [2020, 2019, 2022, 2021, 2022],
             '지사' : ['한국', '한국', '미국', '한국', '미국'],
             '고객수' : [200, 300, 250, 450, 500]}
pd.DataFrame(table_data)

     연도  지사  고객수
0  2020  한국  200
1  2019  한국  300
2  2022  미국  250
3  2021  한국  450
4  2022  미국  500

In [12]:
# column의 순서를 지정하고자 할 때
df = pd.DataFrame(table_data, columns = ['지사', '연도', '고객수'])
df

   지사    연도  고객수
0  한국  2020  200
1  한국  2019  300
2  미국  2022  250
3  한국  2021  450
4  미국  2022  500

In [ ]:
# 행과 열의 구조를 가진 데이터인 DataFrame
# 행 방향의 index 확인하기
df.index

In [ ]:
# 열 방향의 index 즉, column 확인하기
df.columns

In [ ]:
# DataFrame 내부에 저장된 values 확인하기
df.values

딕셔너리를 이용하여 다음과 같이 DataFrame의 frame을 만들어보자 -> 사진 : PPT 참고

In [ ]:
# 여기에 코드를 작성해주세요

### Pandas 구조적 데이터 다루기

데이터 연산 및 통계 분석

In [13]:
# Series 데이터 연산
s1 = pd.Series([10, 20, 30, 40, 50])
s2 =pd.Series([1, 2, 3, 4, 5])
s1 + s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [14]:
s1 - s2

0     9
1    18
2    27
3    36
4    45
dtype: int64

In [15]:
s1 * s2

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [16]:
# 데이터 크기가 다른 경우는 어떨까? -> 오류가 나진 않고 NaN
s1 = pd.Series([1, 2, 3, 4, 5, 6, 7])
s2 = pd.Series([10, 20, 30, 40, 50]) 
s1+s2

0    11.0
1    22.0
2    33.0
3    44.0
4    55.0
5     NaN
6     NaN
dtype: float64

In [17]:
# DataFrame 데이터 연산
table_data1 = {'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50],
               'C': [100, 200, 300, 400, 500]}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [18]:
table_data2 = {'A': [6, 7, 8], 'B': [60, 70, 80], 'C': [600, 700, 800]}
df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [19]:
df1+df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [20]:
# 계절별 강수량 DataFrame 생성
table_data3 = {'봄': [200.1, 200.2, 200.3, 200.4, 200.5],
              '여름': [700.1, 700.2, 700.3, 700.4, 700.5],
              '가을': [300.1, 300.2, 300.3, 300.4, 300.5],
              '겨울': [100.1, 100.2, 100.3, 100.4, 100.5]}
index_list = ['2012', '2013', '2014', '2015', '2016']
df3 = pd.DataFrame(table_data3, index = index_list)
df3

          봄     여름     가을     겨울
2012  200.1  700.1  300.1  100.1
2013  200.2  700.2  300.2  100.2
2014  200.3  700.3  300.3  100.3
2015  200.4  700.4  300.4  100.4
2016  200.5  700.5  300.5  100.5

In [21]:
# 통계 분석을 위한 메소드
# mean() : 평균
# std() : 표준편차
df3.mean() # 기본 : 열 방향

봄     200.3
여름    700.3
가을    300.3
겨울    100.3
dtype: float64

In [22]:
df3.mean(axis=1) # axis=1 : 행 방향

2012    325.1
2013    325.2
2014    325.3
2015    325.4
2016    325.5
dtype: float64

In [23]:
# 열 방향에 대한 표준편차를 구해보세요
df3.std()

봄     0.158114
여름    0.158114
가을    0.158114
겨울    0.158114
dtype: float64

In [ ]:
# 행 방향에 대한 표준편차를 구해보세요

DataFrame Indexing

In [24]:
# 2010년부터 2017년까지 노선별 KTX 이용자수
import pandas as pd
import numpy as np
KTX_data = {'경부선 KTX': [30000, 30000, 40000, 40000, 40000, 40000, 30000],
 '호남선 KTX': [7000, 6000, 6000, 6000, 8000, 10000, 9000],
 '경전선 KTX': [3000, 4000, 4000, 4000, 4000, 4000, 5000],
 '전라선 KTX': [300, 1000, 1000, 2000, 3000, 3000, 5000],
 '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2000, 3000, 6000]}
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']
df_KTX = pd.DataFrame(KTX_data, index = index_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    30000     7000     3000      300      NaN
2012    30000     6000     4000     1000      NaN
2013    40000     6000     4000     1000      NaN
2014    40000     6000     4000     2000      NaN
2015    40000     8000     4000     3000   2000.0
2016    40000    10000     4000     3000   3000.0
2017    30000     9000     5000     5000   6000.0

In [26]:
# 데이터의 처음 일부분과 끝의 일부분만 선택하여 반환
df_KTX.head(3) # 괄호 안에 숫자를 써서 개수 지정 가능

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    30000     7000     3000      300      NaN
2012    30000     6000     4000     1000      NaN
2013    40000     6000     4000     1000      NaN

In [27]:
df_KTX.tail() # 괄호 안에 숫자를 써서 개수 지정 가능

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    40000     6000     4000     1000      NaN
2014    40000     6000     4000     2000      NaN
2015    40000     8000     4000     3000   2000.0
2016    40000    10000     4000     3000   3000.0
2017    30000     9000     5000     5000   6000.0

In [28]:
# 연속된 구간의 행 데이터 선택
df_KTX[1:2] #[행 시작 위치 : 행 끝 위치]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    30000     6000     4000     1000      NaN

In [29]:
df_KTX[2:5]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    40000     6000     4000     1000      NaN
2014    40000     6000     4000     2000      NaN
2015    40000     8000     4000     3000   2000.0

In [30]:
# index 항목 이름을 지정해 행 선택
df_KTX.loc['2011']

경부선 KTX    30000.0
호남선 KTX     7000.0
경전선 KTX     3000.0
전라선 KTX      300.0
동해선 KTX        NaN
Name: 2011, dtype: float64

In [32]:
# column 항목 이름을 지정해 열 선택
# 한 column을 지정해서 작성해보세요
df_KTX['호남선 KTX']

2011     7000
2012     6000
2013     6000
2014     6000
2015     8000
2016    10000
2017     9000
Name: 호남선 KTX, dtype: int64

In [33]:
# index 항목 이름으로 연속된 구간의 행 선택
df_KTX.loc['2013':'2016']

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    40000     6000     4000     1000      NaN
2014    40000     6000     4000     2000      NaN
2015    40000     8000     4000     3000   2000.0
2016    40000    10000     4000     3000   3000.0

In [34]:
# 하나으 열을 선택한 후 index 범위를 지정해 선택
df_KTX['경부선 KTX']['2012':'2014']

2012    30000
2013    40000
2014    40000
Name: 경부선 KTX, dtype: int64

In [37]:
# 호남선 KTX의 2번, 3번, 4번 index가 나오게 범위를 지정해 선택해보세요.
df_KTX['호남선 KTX'][2:5]

2013    6000
2014    6000
2015    8000
Name: 호남선 KTX, dtype: int64

In [38]:
df_KTX['호남선 KTX']['2013':'2015']

2013    6000
2014    6000
2015    8000
Name: 호남선 KTX, dtype: int64

In [39]:
# 하나의 원소만 선택하는 방법
df_KTX['호남선 KTX']['2016']

10000

In [40]:
df_KTX['호남선 KTX'].loc['2016']

10000

In [41]:
df_KTX.loc['2016']['호남선 KTX']

10000.0

In [43]:
# DataFrame의 행과 열을 바꾸는 방법 : 전치
df_KTX.T

            2011     2012     2013     2014     2015     2016     2017
경부선 KTX  30000.0  30000.0  40000.0  40000.0  40000.0  40000.0  30000.0
호남선 KTX   7000.0   6000.0   6000.0   6000.0   8000.0  10000.0   9000.0
경전선 KTX   3000.0   4000.0   4000.0   4000.0   4000.0   4000.0   5000.0
전라선 KTX    300.0   1000.0   1000.0   2000.0   3000.0   3000.0   5000.0
동해선 KTX      NaN      NaN      NaN      NaN   2000.0   3000.0   6000.0

In [44]:
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    30000     7000     3000      300      NaN
2012    30000     6000     4000     1000      NaN
2013    40000     6000     4000     1000      NaN
2014    40000     6000     4000     2000      NaN
2015    40000     8000     4000     3000   2000.0
2016    40000    10000     4000     3000   3000.0
2017    30000     9000     5000     5000   6000.0

데이터프레임 데이터 변경하기

In [45]:
KTX_data = {'경부선 KTX': [30000, 30000, 40000, 40000, 40000, 40000, 30000],
 '호남선 KTX': [7000, 6000, 6000, 6000, 8000, 10000, 9000],
 '경전선 KTX': [3000, 4000, 4000, 4000, 4000, 4000, 5000],
 '전라선 KTX': [300, 1000, 1000, 2000, 3000, 3000, 5000],
 '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2000, 3000, 6000]}
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']
df_KTX = pd.DataFrame(KTX_data, index = index_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    30000     7000     3000      300      NaN
2012    30000     6000     4000     1000      NaN
2013    40000     6000     4000     1000      NaN
2014    40000     6000     4000     2000      NaN
2015    40000     8000     4000     3000   2000.0
2016    40000    10000     4000     3000   3000.0
2017    30000     9000     5000     5000   6000.0

In [46]:
# DataFrame에 새로운 열과 데이터 추가
df_KTX['강릉선 KTX']=[100,200,300,400,500,600,700]
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX  강릉선 KTX
2011    30000     7000     3000      300      NaN      100
2012    30000     6000     4000     1000      NaN      200
2013    40000     6000     4000     1000      NaN      300
2014    40000     6000     4000     2000      NaN      400
2015    40000     8000     4000     3000   2000.0      500
2016    40000    10000     4000     3000   3000.0      600
2017    30000     9000     5000     5000   6000.0      700

In [48]:
# df_KTX 데이터 프레임에 새로운 열 '인천선 KTX'를 추가해보세요.
# 새로운 데이터는 여러분이 임의로 넣어주시면 됩니다.
df_KTX['인천선 KTX'] = [300, 200, 100, np.nan, 160, np.nan, 450]
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX  강릉선 KTX  인천선 KTX
2011    30000     7000     3000      300      NaN      100    300.0
2012    30000     6000     4000     1000      NaN      200    200.0
2013    40000     6000     4000     1000      NaN      300    100.0
2014    40000     6000     4000     2000      NaN      400      NaN
2015    40000     8000     4000     3000   2000.0      500    160.0
2016    40000    10000     4000     3000   3000.0      600      NaN
2017    30000     9000     5000     5000   6000.0      700    450.0

### 데이터 통합하기 - 제외

In [ ]:
df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]})
df1

In [ ]:
df2 = pd.DataFrame({'Class1': [87, 89],'Class2': [85, 90]})
df2

In [ ]:
# 세로 방향으로 통합하기
df1.append(df2) # 깔끔하게 정리되지 않는 인덱스

In [ ]:
df1.append(df2, ignore_index=True)

In [ ]:
# 이때 df1의 원래 데이터는 수정되지 않음.
# 복사본으로 새로운 DataFrame의 데이터가 반환되었던 것.
df1

In [ ]:
# 열의 개수가 다른 DataFrame을 통합할 땐?
df3 = pd.DataFrame({'Class1': [96, 83]})
df3

In [ ]:
df2 = pd.DataFrame({'Class1': [87, 89],'Class2': [85, 90]})
df2

In [ ]:
# df2 DataFrame에 df3를 세로 방향으로 통합해보세요.
df2.append(df3, ignore_index=True) # 예전에는 빈 값에 NaN이 들어갔는데 지금은 변경
df2

In [ ]:
# 가로 방향으로 통합하기
df4 = pd.DataFrame({'Class3': [93, 91, 95, 98]})
df4

In [ ]:
df1

In [ ]:
df1.join(df4)

In [ ]:
# index의 크기가 다른 경우는 어떨까?
df5 = pd.DataFrame({'Class4': [82, 92]})
df5

In [ ]:
df1

In [ ]:
df1.join(df5)

In [ ]:
# 인덱스 라벨을 지정한 경우에는 index가 같아야 join 함수를 사용가능하다.
index_label = ['a', 'b', 'c', 'd']
# 위와 같은 인덱스 라벨을 갖도록 df1과 df4를 수정하여 dfa, dfb로 만들고
# 가로 방향으로 통합해보세요. (join 함수를 사용하세요.)

In [ ]:
# 여기에 문제를 풀어보세요

In [ ]:
# 특정 열을 기준으로 통합하기
# 두 DataFrame의 공통된 Key를 중심으로 통합
df_A_B = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품A': [100, 150, 200, 130],
                       '제품B': [90, 110, 140, 170]})
df_A_B

In [ ]:
df_C_D = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품C': [112, 141, 203, 134],
                       '제품D': [90, 110, 140, 170]})
df_C_D

In [ ]:
df_A_B.merge(df_C_D) # 판매월을 기준으로 통합된 것 확인 가능

In [ ]:
# 두 개의 DataFrame이 특정 열을 기준으로 일부만 공통된 값을 갖는 경우
df_left = pd.DataFrame({'key':['A','B','C'], 'left': [1, 2, 3]})
df_left

In [ ]:
df_right = pd.DataFrame({'key':['A','B','D'], 'right': [4, 5, 6]})
df_right

In [ ]:
# 왼쪽 데이터는 모두 선택, 지정된 열(key)에 값이 있는 오른쪽 데이터 선택
df_left.merge(df_right, how='left', on='key')

In [ ]:
# 오른쪽 데이터는 모두 선택, 지정된 열(key)에 값이 있는 왼쪽 데이터 선택
# 위 코드를 참고하여 작성해보세요.

### 데이터 파일 읽고 쓰기

프로그래밍 환경에서 .csv 파일 만들고 읽기

In [50]:
%%writefile C:\Users\CSH\Desktop\sea_rain1.csv
연도,동해,남해,서해,전체
1996,15,16,17,18
1997,13,14,15,16
1998,17,16,15,14
1999,18,18,17,17

Writing C:\Users\CSH\Desktop\sea_rain1.csv

In [51]:
pd.read_csv(r'C:\Users\CSH\Desktop\sea_rain1.csv', encoding = 'utf-8')

     연도  동해  남해  서해  전체
0  1996  15  16  17  18
1  1997  13  14  15  16
2  1998  17  16  15  14
3  1999  18  18  17  17

윈도우 메모장에서 .csv 파일 작성 후 읽기 -> ppt 사진 참고

In [54]:
pd.read_csv(r'C:\Users\CSH\Desktop\sea_rain2.csv', encoding = 'utf-8')
# 윈도우 메모장을 통해 작성한 파일을 읽어올 경우에는 인코딩 방식을 cp949로

     연도  동해  남해  서해  전체
0  1996  15  16  17  18
1  1997  13  14  15  16
2  1998  17  16  15  14
3  1999  18  18  17  17

윈도우 메모장에서 .txt 파일 작성 후 읽기 -> ppt 사진 참고

In [ ]:
pd.read_csv(r'C:\Users\CSH\Desktop\sea_rain1.txt', sep="",
            index_col="연도", encoding='cp949')

### 데이터 분석을 위해 자주 쓰이는 함수들

In [55]:
data = {'국어' : [30, 50, 70, 90],
       '영어' : [70, 80, 60, 80],
       '수학' : [50, 80, 60, 70]}
df_sub = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
df_sub

       국어  영어  수학
one    30  70  50
two    50  80  80
three  70  60  60
four   90  80  70

In [56]:
# shape : 행과 열의 개수를 알려준다
df_sub.shape

(4, 3)

In [57]:
# len : 인자로 넘겨주는 DataFrame의 행의 개수를 알려준다
len(df_sub)

4

In [58]:
# size : DataFrame에 저장된 데이터 개수를 알려준다
df_sub.size

12

In [59]:
# dtype : DataFrame의 column들이 갖는 값들의 data type들을 알려주는 기능을 수행.
# 특정 column의 data type만 알 수도 있다.
df_sub.dtypes

국어    int64
영어    int64
수학    int64
dtype: object

In [60]:
# iloc[] : DataFrame의 인덱싱 슬라이싱 (인덱스 번호 기준) 기능을 수행한다
df_sub.iloc[0]

국어    30
영어    70
수학    50
Name: one, dtype: int64

In [61]:
# loc[] : Dataframe의 인덱싱 슬라이싱 (부여된 인덱스명 칼럼명으로) 기능을 수행한다.
df_sub.loc['two':'four']

       국어  영어  수학
two    50  80  80
three  70  60  60
four   90  80  70

In [62]:
# drop : 주어진 column 또는 row 명에 해당하는 데이터들을 삭제하는 기능을 수행
df_sub.drop(index='four')

       국어  영어  수학
one    30  70  50
two    50  80  80
three  70  60  60

In [63]:
df_sub # 실제 반영 없음.

       국어  영어  수학
one    30  70  50
two    50  80  80
three  70  60  60
four   90  80  70

In [67]:
data_na = {'국어' : [30, np.nan, 70, 90],
       '영어' : [70, 80, np.nan, np.nan],
       '수학' : [np.nan, np.nan, 60, 70]}
df_na = pd.DataFrame(data_na, index=['one', 'two', 'three', 'four'])
df_na

         국어    영어    수학
one    30.0  70.0   NaN
two     NaN  80.0   NaN
three  70.0   NaN  60.0
four   90.0   NaN  70.0

In [65]:
# isna() : DataFrame 내부 데이터의 결측값 여부를 판단. 결측값이 있는 곳은 True 반환
df_na.isna()

          국어     영어     수학
one    False  False   True
two     True  False   True
three  False   True  False
four   False   True  False

In [66]:
# fillna() : DataFrame 내부 데이터의 결측값을 인자로 주어진 특정 값으로 채움
df_na.fillna(1)

         국어    영어    수학
one    30.0  70.0   1.0
two     1.0  80.0   1.0
three  70.0   1.0  60.0
four   90.0   1.0  70.0

In [69]:
df_na['국어']['two'] = 80
df_na

         국어    영어    수학
one    30.0  70.0   NaN
two    80.0  80.0   NaN
three  70.0   NaN  60.0
four   90.0   NaN  70.0

In [70]:
# dropna() : default 행을 기준으로 NaN 값을 삭제하는 기능 수행.
# axis=1 이라는 속성을 주면 열을 기준으로 삭제
df_na.dropna(axis=1)

         국어
one    30.0
two    80.0
three  70.0
four   90.0

pandas 활용 퀴즈

아래에 정의한 dataFrame을 이용하여 각각의 과정을 거친 dataFrame을 각각 출력하세요.  
1. 결측치에 대한 값을 50점으로 통일한 dataFrame
2. 수학 데이터만 보이는 Series
3. 1~3번 인덱스까지만 보이는 dataFrame
4. 임의로 값들을 지정하여 '사회' 과목의 성적들 추가하기
5. column 별로 가장 높은 인덱스 출력 (idxmax())

In [71]:
data_test = {'국어' : [30, np.nan, 70, 90],
           '수학' : [70, 80, np.nan, np.nan],
           '영어' : [90, np.nan, 60, 70],
           '과학' : [90, 80, 50, 70]}
df_test = pd.DataFrame(data_test)
df_test

     국어    수학    영어  과학
0  30.0  70.0  90.0  90
1   NaN  80.0   NaN  80
2  70.0   NaN  60.0  50
3  90.0   NaN  70.0  70

In [72]:
# 여기부터 풀어주세요.
# 1번
df_test.fillna(50)

     국어    수학    영어  과학
0  30.0  70.0  90.0  90
1  50.0  80.0  50.0  80
2  70.0  50.0  60.0  50
3  90.0  50.0  70.0  70

In [73]:
# 2번
df_test['수학']

0    70.0
1    80.0
2     NaN
3     NaN
Name: 수학, dtype: float64

In [74]:
# 3번
df_test.iloc[1:4]

     국어    수학    영어  과학
1   NaN  80.0   NaN  80
2  70.0   NaN  60.0  50
3  90.0   NaN  70.0  70

In [75]:
# 4번
df_test['사회'] = [60, 90, 30, 50]
df_test

     국어    수학    영어  과학  사회
0  30.0  70.0  90.0  90  60
1   NaN  80.0   NaN  80  90
2  70.0   NaN  60.0  50  30
3  90.0   NaN  70.0  70  50

In [76]:
# 5번
df_test.idxmax()

국어    3
수학    1
영어    0
과학    0
사회    1
dtype: int64